import React, { Component} from 'react'
import { render } from 'react-dom'

import  './Time_Axis.scss'

class Time_Axis extends Component {
    render() {
        return (
            <section className="time_axis">
                <article>
                    <time datatime="2016-06-20 19:34" className="time_axis_item_time">2016-06-20 19:34</time>
                    <section >
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                    </section>
                </article>
                <article>
                    <time datatime="2016-06-20 19:34" className="time_axis_item_time">2016-06-20 19:34</time>
                    <section >
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                    </section>
                </article>
                <article>
                    <time datatime="2016-06-20 19:34" className="time_axis_item_time">2016-06-20 19:34</time>
                    <section >
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                        今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结今天有点小纠结
                    </section>
                </article>
            </section>
        )
    }
}

export default Time_Axis